{
  "webDevelopment": {
    "title": "Coding languages",
    "items": {
      "HTML5": {
        "title": "HTML5",
        "description": "I write W3C compliant, semantic HTML markup which is optimised for search engine indexing, accessible to people using assitive technologies and is easy to maintain and scale for fellow developers. I'm also familiar with SilverStripe template syntax, JSX, and have some experiece with Shopify Liquid.",
        "image": "./img/contained-carousel/html-5-shield.svg"
      },
      "CSS3": {
        "title": "CSS3",
        "description": "Combined with mobile first CSS, utilising the latest CSS layout modules to create immersive, fully responsive user experiences. <br/><br/>I use the BEM methodology to ensure that there are never any CSS selector conflicts, which makes for incredibly robust styling solutions.",
        "image": "./img/contained-carousel/css-3-shield.svg"
      },
      "javascript": {
        "title": "Javascript ES6",
        "description": "Lastly a sprinkle of DRY, modular ES6 Javascript to create interactive and engaging UI components. <br/><br/>I use Babel transpiler to convert edge JavaScript to cross browser compatible ES5 Javascript.",
        "image": "./img/contained-carousel/javascript-shield.svg"
      }
    }
  },
  "webTechnologies": {
    "title": "Favourite Web Technologies",
    "items": {
      "react": {
        "title": "React",
        "description": "I build interactive UIs using React functional components and JSX to create templates with variables for dynamic content.",
        "image": "./img/contained-carousel/react-logo.svg"
      },
      "bootstrap": {
        "title": "Bootstrap",
        "description": "Using Bootstrap as a Library is ideal for rapid development of rock solid websites, now more than ever with the Sass customisation options in Bootstrap 5.",
        "image": "./img/contained-carousel/bootstrap-5-logo.svg"
      },
      "gsap": {
        "title": "GSAP 3",
        "description": "Animations (when done appropriately) are an excellent way to enhance your application/website's user journey. I use GreenSock Animation Platform (GSAP) a powerful JavaScript animation library to create highly customisable animations, with timelines for more complex animation sequences. GSAP is also extremely light weight and is cross browser compatible (Chrome, Firefox, and IE 11+).",
        "image": "./img/contained-carousel/gsap-greensock-logo.svg"
      },
      "sass": {
        "title": "SASS",
        "description": "My CSS processor of choice is SASS, it awesome being able to nest media queries so that default and responsive styles can be read within the same selector. SASS mixins and extends make writing efficient and reusable styles a breeze.",
        "image": "./img/contained-carousel/sass-logo.svg"
      },
      "yarn": {
        "title": "Yarn Package Manager",
        "description": "I use Yarn to quickly, securely and reliably manage project dependencies via the package.json file. There's no need to reinvent the wheel when you can simply 'yarn add' tried and tested code that does exactly what you need (example: gsap) straight into your project in a matter of seconds. An added benefit of having the package.json file is that fellow developers that are working on the same repo will have the same package versions making the project reproducible and future proof.",
        "image": "./img/contained-carousel/yarn-package-manager-logo.svg"
      },
      "git": {
        "title": "GIT Version Control",
        "description": "GIT is an essential part of my workflow, it makes collaborating with fellow developers easy, it's also great for adding new features, by creating a new branch, the new feature can be developed, tested and reviewed without affecting the main branches source code. I enjoy using Git Tower and GitKraken for enhanced visibility of my code changes which allows me to quickly and easily review my code before staging and committing, or even amending a previous commit where appropriate.",
        "image": "./img/contained-carousel/git-logo-and-text.svg"
      }
    }
  }
}